Revit 2024 API
View3D.GetOrientation Method
 Gets the current non-saved orientation of the View3D.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ViewOrientation3D GetOrientation()
Visual Basic
Public Function GetOrientation As ViewOrientation3D
Visual C++
public:
ViewOrientation3D^ GetOrientation()
Return Value
 The current non-saved orientation of the View3D.
See Also
View3D Class
Autodesk.Revit.DB Namespace